app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by(id: session[:userid])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1