app/controllers/customer_controller.rb

       def index
          @free_two = Spot.where(vtype: 2, status: false).count
          @allo_two = Spot.where(vtype: 2, status: true).count
          @free_four = Spot.where(vtype: 4, status: false).count
          @allo_four = Spot.where(vtype: 4, status: true).count
          @customers = Customer.where(exit: nil).paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM `spots` WHERE `spots`.`vtype` = 2 AND `spots`.`status` = FALSE
SELECT COUNT(*) FROM `spots` WHERE `spots`.`vtype` = 4 AND `spots`.`status` = FALSE
SELECT COUNT(*) FROM `customers` WHERE `customers`.`exit` IS NULL
SELECT `customers`.* FROM `customers` WHERE `customers`.`exit` IS NULL LIMIT 5 OFFSET 0

       def details
          @customersall = Customer.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM `customers`
SELECT `customers`.* FROM `customers` LIMIT 5 OFFSET 0

       def show
          @customers = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 8 LIMIT 1

       def checkout
       if params[:vnum].present?
         @customer = Customer.find_by(vnum: params[:vnum], exit: nil)
              # Customer.joins(:Spot).where("vnum = ? and Spots.status = ?", params[:vnum], true).first
         if @customer.present?

           entry_time = @customer.entry
           @exit_time = Time.now
           @duration = @exit_time-entry_time
           if @customer.vtype == "2"
             @price = if @duration <= 2.hours
               30
             else
               30 + 20* ((@duration - 2.hours)/1.hours).ceil
             end
           else
              @price = if @duration <= 2.hours
              50
              else
              50 + 20* ((@duration - 2.hours)/1.hours).ceil
              end
           end
           @customer.update(exit: @exit_time, price: @price)
           @spot = Spot.find_by(id: @customer.spot_id)
           @spot.update(status: false)
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`vnum` = 'KA23MR1222' AND `customers`.`exit` IS NULL LIMIT 1
UPDATE `customers` SET `customers`.`exit` = '2023-02-11 08:02:14.351266', `customers`.`price` = 830.0, `customers`.`updated_at` = '2023-02-11 08:02:14.371795' WHERE `customers`.`id` = 8
SELECT `spots`.* FROM `spots` WHERE `spots`.`id` = 5 LIMIT 1
UPDATE `spots` SET `spots`.`status` = FALSE, `spots`.`updated_at` = '2023-02-11 08:02:14.389189' WHERE `spots`.`id` = 5

        def new
           @two, @four = Spot.where(status: false).partition{|spot| spot.vtype == 2}
           @customer = Customer.new
           @free_two = Spot.where(vtype: 2, status: false).count
           @allo_two = Spot.where(vtype: 2, status: true).count
           @free_four = Spot.where(vtype: 4, status: false).count
           @allo_four = Spot.where(vtype: 4, status: true).count
---
SELECT `spots`.* FROM `spots` WHERE `spots`.`status` = FALSE
SELECT COUNT(*) FROM `spots` WHERE `spots`.`vtype` = 2 AND `spots`.`status` = FALSE
SELECT COUNT(*) FROM `spots` WHERE `spots`.`vtype` = 4 AND `spots`.`status` = FALSE
SELECT COUNT(*) FROM `spots` WHERE `spots`.`vtype` = 4 AND `spots`.`status` = TRUE

    def create
       @free_two = Spot.where(vtype: 2, status: false).count
       @allo_two = Spot.where(vtype: 2, status: true).count
       @free_four = Spot.where(vtype: 4, status: false).count
       @allo_four = Spot.where(vtype: 4, status: true).count
       @two, @four = Spot.where(status: false).partition{|spot| spot.vtype == 2}
       spot = Spot.find_by(id: customer_params[:spot_id])

       customer_vnum = Customer.find_by(vnum: customer_params[:vnum], exit: nil)
       @customer = Customer.new(customer_params)
       if !customer_vnum.nil?
         @customer.errors.add(:base, "Vehicle already Spoted")
         render :new, status: :unprocessable_entity
       else

         if spot.nil?
            @customer.errors.add(:base, "Select Spot")
            render :new, status: :unprocessable_entity
         else
           @customer = Customer.new(customer_params)
           @customer.entry =  Time.now
           @customer.exit = nil
           @customer.price = nil
           @customer.spots = spot.spots
           @customer.vtype = spot.vtype

           if @customer.save
             spot.update(status: true)
---
SELECT COUNT(*) FROM `spots` WHERE `spots`.`vtype` = 2 AND `spots`.`status` = FALSE
SELECT COUNT(*) FROM `spots` WHERE `spots`.`vtype` = 4 AND `spots`.`status` = FALSE
SELECT COUNT(*) FROM `spots` WHERE `spots`.`vtype` = 4 AND `spots`.`status` = TRUE
SELECT `spots`.* FROM `spots` WHERE `spots`.`status` = FALSE
SELECT `spots`.* FROM `spots` WHERE `spots`.`id` = 5 LIMIT 1
SELECT `customers`.* FROM `customers` WHERE `customers`.`vnum` = 'KA23MR1232' AND `customers`.`exit` IS NULL LIMIT 1
INSERT INTO `customers` (`vnum`, `vtype`, `entry`, `exit`, `price`, `spots`, `spot_id`, `created_at`, `updated_at`, `email`) VALUES ('KA23MR1232', '2', '2023-02-15 07:07:27.643894', NULL, NULL, '3', 5, '2023-02-15 07:07:27.648249', '2023-02-15 07:07:27.648249', 'wewdwedsdsd@ewd.fg')
UPDATE `spots` SET `spots`.`status` = TRUE, `spots`.`updated_at` = '2023-02-15 07:07:27.660405' WHERE `spots`.`id` = 5

  def report

    session[:start_date] = params[:start_date]
    session[:end_date] = params[:end_date]
    session[:vtype] = params[:vtype]

    start_date = session[:start_date] || 7.days.ago
    end_date = session[:end_date] || Date.today
    vtype = session[:vtype] || "All"

    if start_date == "" || end_date == ""
        flash[:error] = "* Please select both Start and End date"
        start_date = 7.days.ago
        end_date = Date.today
    else
      start_date = Date.parse(session[:start_date]) if session[:start_date]
      end_date = Date.parse(session[:end_date]) if session[:end_date]
    end

    @vehicles = Customer.where(created_at: start_date.beginning_of_day..end_date.end_of_day)
    @vehicles = @vehicles.where(vtype: vtype) unless vtype == "All"
    @amount = @vehicles.sum(:price)
---
SELECT SUM(`customers`.`price`) FROM `customers` WHERE `customers`.`created_at` BETWEEN '2023-02-07 18:30:00' AND '2023-02-15 18:29:59.999999' AND `customers`.`vtype` = '2'