app/controllers/customer_controller.rb

  def report
    session[:start_date] = params[:start_date]
    session[:end_date] = params[:end_date]
    session[:vtype] = params[:vtype]

    start_date = session[:start_date] || 7.days.ago
    end_date = session[:end_date] || Date.today
    vtype = session[:vtype] || 'All'

    if start_date == '' || end_date == ''
      flash[:error] = '* Please select both Start and End date'
      start_date = 7.days.ago
      end_date = Date.today
    else
      start_date = Date.parse(session[:start_date]) if session[:start_date]
      end_date = Date.parse(session[:end_date]) if session[:end_date]
    end

    @vehicles = Customer.where(exit: start_date.beginning_of_day..end_date.end_of_day)
    authorize @vehicles
    @vehicles = @vehicles.where(vtype: vtype) unless vtype == 'All'
    @amount = @vehicles.sum(:price)
---
SELECT SUM(`customers`.`price`) FROM `customers` WHERE `customers`.`exit` BETWEEN '2023-02-16 18:30:00' AND '2023-02-24 18:29:59.999999' AND `customers`.`vtype` = '2'