app/controllers/spots_controller.rb

SELECT COUNT(*) FROM `spots`
SELECT `spots`.* FROM `spots` LIMIT 5 OFFSET 0
SELECT `customers`.* FROM `customers` WHERE `customers`.`exit` IS NULL
---
   def index
     @spots = Spot.paginate(page: params[:page], per_page: 5)
      begin
        custs = Customer.where(exit: nil)
        if custs.present?

SELECT `spots`.* FROM `spots` WHERE `spots`.`id` = 1 LIMIT 1
---
   def show
     @spots = Spot.find(params[:id])

INSERT INTO `spots` (`spots`, `vtype`, `status`, `created_at`, `updated_at`) VALUES ('9', 2, FALSE, '2023-02-24 13:01:00.256635', '2023-02-24 13:01:00.256635')
---
   def create
     @spot = Spot.new(spots_params)
     @spot.status = false
     if @spot.save

SELECT `spots`.* FROM `spots` WHERE `spots`.`id` = 1 LIMIT 1
---
   def edit
     @spot = Spot.find(params[:id])

SELECT `spots`.* FROM `spots` WHERE `spots`.`id` = 1 LIMIT 1
UPDATE `spots` SET `spots`.`spots` = '2', `spots`.`updated_at` = '2023-02-08 07:50:35.472414' WHERE `spots`.`id` = 1
---
  def update
     @spot = Spot.find(params[:id])
      if @spot.update(spots_params)

SELECT `spots`.* FROM `spots` WHERE `spots`.`id` = 3 LIMIT 1
DELETE FROM `spots` WHERE `spots`.`id` = 16
---
    def destroy
     @spot = Spot.find(params[:id])
     @spot.destroy