app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'asertacc95@gmail.com' LIMIT 1
---
  def login
    @user = User.find_by(email: params[:email])

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 5 OFFSET 0
---
  def index
    @users = User.paginate(page: params[:page], per_page: 5)

UPDATE `users` SET `users`.`updated_at` = '2023-02-24 12:34:26.963719', `users`.`password_digest` = '$2a$12$4806nFK3Fbzqg/k2PoCGpeQDn92u78u2E2CJFtV2qnGHSkA1CgCYi' WHERE `users`.`id` = 5
---
  def update
    if @user.update(sess_params)

INSERT INTO `users` (`email`, `name`, `password`, `role`, `created_at`, `updated_at`, `password_digest`) VALUES ('adwdasdded@qwqw.in', 'harshas', NULL, 1, '2023-02-24 12:34:01.501250', '2023-02-24 12:34:01.501250', '$2a$12$RT9hDTByY2bVHPmWxb69EeQFnuSogO8hjXp1GjLw4NbfdEY9XEeT2')
---
  def create
    @user = User.new(sess_params)
    authorize @user
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'harshashinyu@gmail.com' LIMIT 1
---
  def forgot
    @user = User.find_by(email: params[:email])
    if @user.present?

UPDATE `users` SET `users`.`password_digest` = 'Qazwsx@12', `users`.`updated_at` = '2023-02-17 09:20:52.169949' WHERE `users`.`id` = 1
---
  def passedit
    if @user.update(password: params[:password])