app/controllers/users_controller.rb

  def show
  @users = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1

 def edit
    @users = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def destroy
   @users = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1