app/models/spot.rb

SELECT `spots`.* FROM `spots` WHERE `spots`.`spots` = '4' AND `spots`.`vtype` IS NULL LIMIT 1
---
    def check_for_duplicates
  existing_record = Spot.find_by(spots: spots, vtype: vtype)