app/models/spot.rb

SELECT COUNT(*) FROM `spots` WHERE `spots`.`vtype` = 2 AND `spots`.`status` = FALSE
SELECT COUNT(*) FROM `spots` WHERE `spots`.`vtype` = 2 AND `spots`.`status` = TRUE
---
  scope :free_spots, ->(vtype) { where(vtype: vtype, status: false).count }
  scope :allocated_spots, ->(vtype) { where(vtype: vtype, status: true).count }